{
  "translation": {
    "mainScreen": {
      "navTitle": "Meni",
      "textWelcome": "콯ivijo razvijalci 游녦游낖",
      "textAbout": "Ta vzor캜na aplikacija prikazuje nekaj preprostih funkcionalnosti, ki sem jih implementiral, da bi vam pomagal bolje razumeti moje sposobnosti.",
      "form": "Obrazec",
      "list": "Seznam",
      "language": "Jezik",
      "routing": "Auth Navigacija",
      "info": "Info"
    },
    "formScreen": {
      "navTitle": "Obrazec",
      "text": "Za upravljanje obrazcev v React Native uporabljam 'react-hook-form'. Omogo캜a mi implementacijo zmogljivih, prilagodljivih in raz코irljivih obrazcev z enostavno uporabo validacije. Kombiniram ga z validacijo 'yup'.",
      "email": {
        "label": "Email Naslov",
        "required": "Vpi코i email naslov",
        "format": "Uporabite pravilen format"
      },
      "password": {
        "label": "Geslo",
        "required": "Vpi코i geslo",
        "matches": "Geslo ne sme vsebovati presledkov"
      },
      "submit": {
        "title": "Obrazec Poslan",
        "text": "Hvala za uporabo obrazca",
        "button": "Po코lji Obrazec"
      }
    },
    "listScreen": {
      "navTitle": "Seznam",
      "text": "Implementacija seznama s podatki iz stre쬹ika. Obo쬿jem uporabo 'react-query' knji쬹ice za obdelavo klicev API, saj ponuja re코itve za vse potrebe in odli캜en mehanizem predpomnjenja. Prav tako uporabljam shopifyjev komponento 'flashlist' in 'expo-image' za najbolj코o mo쬹o zmogljivost. Memorizacija komponente bistveno prispeva k ponovnemu izrisu.",
      "empty": "Ni najdenih zadetkov.",
      "refetch": "Osve쬴"
    },
    "languageScreen": {
      "navTitle": "Jezik",
      "text": "Tukaj lahko spremenite jezik aplikacije. Sprememba je brezhibna in se odra쬬 na vseh zaslonih. Izbrani jezik je shranjen v asinhroni shrambi, kar zagotavlja, da se izbrana mo쬹ost uporabi tudi po tem, ko uporabnik zapre in znova odpre aplikacijo.",
      "eng": "游쥟릖 Angle코캜ina",
      "slo": "游젏릖 Sloven코캜ina"
    },
    "routingScreen": {
      "navTitle": "Auth Navigacija",
      "text": "Ve캜ina aplikacij potrebuje preverjanje pristnosti uporabnika za dostop do osebnih ali zasebnih podatkov. Tukaj je primer najbolj코ih praks za navigacijo na za코캜itene zaslone. Obi캜ajno uporabljam expo-secure-store za shranjevanje 쬰tonov, vendar je za ta primer async-storage dovolj",
      "button": "Prijava"
    },
    "infoScreen": {
      "navTitle": "Info",
      "text1": "Upam, da ste u쬴vali pri raziskovanju te hitre vzor캜ne aplikacije! Poskrbel sem, da sem vklju캜il bistvene funkcionalnosti, ki so obi캜ajno potrebne v resni캜nih aplikacijah, v 캜asu, ki sem ga imel na voljo.",
      "text2": "캛e imate kakr코na koli vpra코anja o tem, kako stvari delujejo, se lahko med intervjujem prosto obrnete name. Z veseljem se pogovorim o tem. Se vidimo! 游땕"
    },
    "protectedScreen": {
      "navTitle": "Za코캜iteno",
      "text": "Nahajate se na za코캜itenem zaslonu, kjer se lahko odjavite in vrnete v meni. Status preverjanja pristnosti je shranjen v shrambi naprave, kar zagotavlja pravilen prikaz zaslona ob ponovnem zagonu aplikacije.",
      "button": "Odjava"
    },
    "general": {
      "error": {
        "title": "Napaka 游",
        "text": "Pri코lo je do napake. Poskusite 코e enkrat."
      }
    }
  }
}
